Revit 2026 API

# FabricationItemFile Class

---

This class holds information about the item file, including whether it is already loaded from disk into Revit.

SystemObject Autodesk.Revit.DBFabricationItemFile

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationItemFile : IDisposable
```
```vb
Public Class FabricationItemFile
	Implements IDisposable
```
```cpp
public ref class FabricationItemFile : IDisposable
```
```fsharp
type FabricationItemFile =
    class
        interface IDisposable
    end
```

The FabricationItemFile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Identifier | The string identifier for the item file. This string is unique and can be used to compare whether fabrication item files are the same file. |
|  | IsUsed | Checks to see if the item file is already in use in the project. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FabricationItemFile |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetImage | Gets the image for the fabrication item file. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsLoaded | Checks to see if the item file has been loaded into the configuration. |
|  | IsValid | Checks to see if the item file is valid. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This object is created as a result of loading from disk.

#### Reference

Autodesk.Revit.DB Namespace